dun_2 = [['*' for _ in range(250)] for _ in range(250)]

# Финальная комната (10x10) в позиции y=100-110, x=60-70
for i in range(10):
    for j in range(10):
        dun_2[8+i][120+j] = ' '

# Начальный вертикальный коридор снизу к стартовой комнате
for i in range(235, 250):
    dun_2[i][65] = ' '
    dun_2[i][66] = ' '
    dun_2[i][67] = ' '
    dun_2[i][68] = ' '

# Вертикальные проходы
for i in range(155, 228):
    dun_2[i][15] = ' '
    dun_2[i][16] = ' '
    dun_2[i][17] = ' '
    dun_2[i][18] = ' '
for i in range(164, 228):
    dun_2[i][103] = ' '
    dun_2[i][104] = ' '
    dun_2[i][105] = ' '
    dun_2[i][106] = ' '
for i in range(197, 228):
    dun_2[i][224] = ' '
    dun_2[i][225] = ' '
    dun_2[i][226] = ' '
    dun_2[i][223] = ' '
    dun_2[i][188] = ' '
    dun_2[i][189] = ' '
    dun_2[i][190] = ' '
    dun_2[i][187] = ' '
for i in range(90, 185):
    dun_2[i][69] = ' '
    dun_2[i][70] = ' '
    dun_2[i][71] = ' '
    dun_2[i][72] = ' '
for i in range(126, 193):
    dun_2[i][139] = ' '
    dun_2[i][140] = ' '
    dun_2[i][141] = ' '
    dun_2[i][142] = ' '
for i in range(126, 165):
    dun_2[i][205] = ' '
    dun_2[i][206] = ' '
    dun_2[i][207] = ' '
    dun_2[i][208] = ' '
for i in range(54, 120):
    dun_2[i][36] = ' '
    dun_2[i][37] = ' '
    dun_2[i][38] = ' '
    dun_2[i][39] = ' '
for i in range(21, 120):
    dun_2[i][5] = ' '
    dun_2[i][6] = ' '
    dun_2[i][7] = ' '
    dun_2[i][8] = ' '
for i in range(98, 128):
    dun_2[i][172] = ' '
    dun_2[i][173] = ' '
    dun_2[i][174] = ' '
    dun_2[i][175] = ' '
for i in range(22, 94):
    dun_2[i][216] = ' '
    dun_2[i][217] = ' '
    dun_2[i][218] = ' '
    dun_2[i][219] = ' '
for i in range(22, 57):
    dun_2[i][179] = ' '
    dun_2[i][180] = ' '
    dun_2[i][181] = ' '
    dun_2[i][182] = ' '
for i in range(21, 55):
    dun_2[i][36] = ' '
    dun_2[i][37] = ' '
    dun_2[i][38] = ' '
    dun_2[i][39] = ' '
for i in range(54, 119):
    dun_2[i][99] = ' '
    dun_2[i][100] = ' '
    dun_2[i][101] = ' '
    dun_2[i][102] = ' '
for i in range(32, 88):
    dun_2[i][142] = ' '
    dun_2[i][143] = ' '
    dun_2[i][144] = ' '
    dun_2[i][145] = ' '
for i in range(10, 32):
    dun_2[i][123] = ' '
    dun_2[i][124] = ' '
    dun_2[i][125] = ' '
    dun_2[i][126] = ' '

# Горизонтальные проходы
for i in range(13, 221):
    dun_2[230][i] = ' '
    dun_2[231][i] = ' '
    dun_2[229][i] = ' '
    dun_2[232][i] = ' '
for i in range(15, 69):
    dun_2[186][i] = ' '
    dun_2[187][i] = ' '
    dun_2[188][i] = ' '
    dun_2[189][i] = ' '
    dun_2[154][i] = ' '
    dun_2[155][i] = ' '
    dun_2[156][i] = ' '
    dun_2[157][i] = ' '
for i in range(102, 139):
    dun_2[195][i] = ' '
    dun_2[196][i] = ' '
    dun_2[197][i] = ' '
    dun_2[198][i] = ' '
for i in range(3, 98):
    dun_2[120][i] = ' '
    dun_2[121][i] = ' '
    dun_2[122][i] = ' '
    dun_2[123][i] = ' '
for i in range(34, 68):
    dun_2[92][i] = ' '
    dun_2[93][i] = ' '
    dun_2[94][i] = ' '
    dun_2[95][i] = ' '
for i in range(3, 98):
    dun_2[56][i] = ' '
    dun_2[57][i] = ' '
    dun_2[58][i] = ' '
    dun_2[59][i] = ' '
for i in range(137, 204):
    dun_2[128][i] = ' '
    dun_2[129][i] = ' '
    dun_2[130][i] = ' '
    dun_2[131][i] = ' '
for i in range(177, 214):
    dun_2[59][i] = ' '
    dun_2[60][i] = ' '
    dun_2[61][i] = ' '
    dun_2[62][i] = ' '
    dun_2[95][i] = ' '
    dun_2[96][i] = ' '
    dun_2[97][i] = ' '
    dun_2[98][i] = ' '
    dun_2[24][i] = ' '
    dun_2[25][i] = ' '
    dun_2[26][i] = ' '
    dun_2[27][i] = ' '
for i in range(3, 67):
    dun_2[23][i] = ' '
    dun_2[24][i] = ' '
    dun_2[25][i] = ' '
    dun_2[26][i] = ' '
for i in range(96, 125):
    dun_2[11][i] = ' '
    dun_2[12][i] = ' '
    dun_2[13][i] = ' '
    dun_2[14][i] = ' '
for i in range(97, 142):
    dun_2[89][i] = ' '
    dun_2[90][i] = ' '
    dun_2[91][i] = ' '
    dun_2[92][i] = ' '
for i in range(140, 178):
    dun_2[59][i] = ' '
    dun_2[60][i] = ' '
    dun_2[61][i] = ' '
    dun_2[62][i] = ' '
for i in range(121, 146):
    dun_2[32][i] = ' '
    dun_2[33][i] = ' '
    dun_2[34][i] = ' '
    dun_2[35][i] = ' '

# Диагональные проходы
for i in range(0, 13):
    dun_2[169 - i][100 - i * 2] = ' '
    dun_2[169 - i][100 - i * 2 - 1] = ' '
    dun_2[168 - i][100 - i * 2] = ' '
    dun_2[168 - i][100 - i * 2 - 1] = ' '
    dun_2[167 - i][100 - i * 2] = ' '
    dun_2[167 - i][100 - i * 2 - 1] = ' '
    dun_2[166 - i][100 - i * 2] = ' '
    dun_2[166 - i][100 - i * 2 - 1] = ' '
for i in range(0, 18):
    dun_2[169 + i * 2 - 6][205 - i] = ' '
    dun_2[170 + i * 2 - 6][205 - i] = ' '
    dun_2[169 + i * 2 - 6][204 - i] = ' '
    dun_2[170 + i * 2 - 6][204 - i] = ' '
    dun_2[169 + i * 2 - 6][203 - i] = ' '
    dun_2[170 + i * 2 - 6][203 - i] = ' '
    dun_2[169 + i * 2 - 6][206 - i] = ' '
    dun_2[170 + i * 2 - 6][206 - i] = ' '
    dun_2[169 + i * 2 - 6][208 + i] = ' '
    dun_2[170 + i * 2 - 6][208 + i] = ' '
    dun_2[169 + i * 2 - 6][209 + i] = ' '
    dun_2[170 + i * 2 - 6][209 + i] = ' '
    dun_2[169 + i * 2 - 6][210 + i] = ' '
    dun_2[170 + i * 2 - 6][210 + i] = ' '
    dun_2[169 + i * 2 - 6][207 + i] = ' '
    dun_2[170 + i * 2 - 6][207 + i] = ' '
for i in range(0, 33):
    dun_2[126 - i][138 + i] = ' '
    dun_2[126 - i][139 + i] = ' '
    dun_2[126 - i][140 + i] = ' '
    dun_2[126 - i][141 + i] = ' '
for i in range(0, 20):
    dun_2[9 + i][92 - i] = ' '
    dun_2[9 + i][91 - i] = ' '
    dun_2[9 + i][90 - i] = ' '
    dun_2[9 + i][89 - i] = ' '
for i in range(0, 24):
    dun_2[54 - i][98 + i] = ' '
    dun_2[54 - i][99 + i] = ' '
    dun_2[54 - i][100 + i] = ' '
    dun_2[54 - i][101 + i] = ' '


# Комнаты (8x8) на пути
rooms = [
    (227, 63), (227, 13), (227, 101), (227, 141), (227, 185), (227, 221),
    (184, 13), (184, 67), (152, 13), (152, 67), (193, 101), (193, 137), (118, 67),
    (164, 101), (158, 137), (197, 185), (197, 221), (155, 203), (126, 137), (126, 203),
    (118, 34), (118, 97), (90, 67), (118, 3), (86, 3), (90, 34), (54, 3), (54, 34),
    (21, 3), (54, 71), (126, 170), (93, 170), (93, 214), (57, 214), (22, 214),
    (22, 177), (57, 177), (9, 88), (21, 67), (21, 34), (30, 121), (87, 97), (54, 97),
    (57, 140), (87, 140)
]

for y, x in rooms:
    for dy in range(0, 8):
        for dx in range(0, 8):
            dun_2[y+dy][x+dx] = ' '

# Обрезка пустого пространства
for i in range(1, len(dun_2) - 1):
    for j in range(1, len(dun_2[i]) - 1):
        if (dun_2[i][j + 1] != ' ' and dun_2[i][j - 1] != ' '
                and dun_2[i + 1][j] != ' ' and dun_2[i - 1][j] != ' '
                and dun_2[i + 1][j + 1] != ' ' and dun_2[i + 1][j - 1] != ' '
                and dun_2[i - 1][j + 1] != ' ' and dun_2[i - 1][j - 1] != ' '):
            dun_2[i][j] = '='

for y, x in rooms:
    for dy in range(0, 8):
        for dx in range(0, 8):
            dun_2[y+dy][x+dx] = '-'

"""for i in dun_2:
    r = ''
    for j in i:
        r += f'{j[0]} '
    print(r)"""